# Задача-1:
# Дан список фруктов. Напишите программу, выводящую фрукты в виде нумерованного списка выровненного по правой сторне
# Пример:
# Дано: ["яблоко", "банан", "киви", "арбуз"]
# Вывод:
# 1. яблоко
# 2.  банан
# 3.   киви
# 4.  арбуз

# Подсказка: использует метод .format()
a = ["яблоко", "банан", "киви", "арбуз"]
for s in range(len(a)):
    print(s+1,'.',"{0:>8}".format(a[s]),sep = '')

# Задача-2:
# Даны два произвольные списка. Удалите из первого списка элементы присутствующие во втором списке
a = [8,1,4,6,3]
b = [9,5,4]
a = set(a).difference(set(b))
print(list(a))
# Задача-3:
# Дан произвольный список из целых чисел. Получите НОВЫЙ список из элементов исходного выполнив следующие условия:
# если элемент кратный двум, то разделить его на 4, если не кратен, то умножить на два.
a = [8,1,4,6,3]
b = []
for x in a:
    if x%2==0:
        b.append(x/4)
    else:
        b.append(x*2)
print(b)
# Задача-1:
# Дан список заполненный произвольными целыми числами, получите новый список элементами которого будут
# квадратные корни элементов исходного списка, но только если результаты извлечения корня не имеют десятичной части и
# если такой корень вообще можно извлечь
# Пример: Дано: [2, -5, 8, 9, -25, 25, 4]   Результат: [3, 5, 2]
x = list(map(int,input().split()))
a = []
for i in x:
    if i>0 and (i**0.5%1==0):
        a.append(int(i**0.5))
print(a)
# Задача-2: Дана дата в формате dd.mm.yyyy, например: 02.11.2013.
# Ваша задача вывести дату в текстовом виде, например: второе ноября 2013 года.
# Склонением пренебречь (2000 года, 2010 года)
d = {'01':'первое','02':'второе','03':'третье','04':'четвертое','05':'пятое','06':'шестое','07':'седьмое','08':'восьмое','09':'девятое','10':'десятое','11':'одиннадцатое','12':'двенадцатое','13':'тринадцатое','14':'четырнадцатое','15':'пятнадцатое','16':'шестнадцатое','17':'семнадцатое','18':'восемнадцатое','19':'девятнадцатое','20':'двадцатое','21':'двадцать первое','22':'двадцать второе','23':'двадцать третье','24':'двадцать четвертое','25':'двадцать пятое','26':'двадцать шестое','27':'двадцать седьмое','28':'двадцать восьмое','29':'двадцать девятое','30':'тридцатое','31':'тридцать первое'}
m = {'01':'января','02':'февраля','03':'марта','04':'апреля','05':'мая','06':'июня','07':'июля','08':'августа','09':'сентября','10':'октября','11':'ноября','12':'декабря'}
s = input()
q,w,e=s.split('.')
print(d[q]+' '+m[w]+' '+e+' года')

# Задача-3: Напишите алгоритм заполняющий список произвольными целыми числами в диапазоне от -100 до 100
# В списке должно быть n - элементов
# Подсказка: для получения случайного числа изпользуйте функцию randint() модуля random
from random import randint
n = int(input())
a = []
for i in range(n):
    a.append(randint(-100,100))
print(a)
# Задача-4: Дан список заполненный произвольными целыми числами
# Получите новый список, элементами которого будут только уникальные элементы исходного
a = list(map(int, input().split()))
j = []
for s in a:
    if s not in j:
        j.append(s)
print(j)

# Задание-1: уравнение прямой вида y = kx - b задано ввиде строки.
# Определить координату y, точки с заданной координатой x

equation = 'y = -12x + 11111140.2121'
x = 2.5
# вычислите и выведите y
e = 'y = -12x - 4.0'
k = float(e[e.find('=')+1:e.find('x')])
x = float(input())

if e.find('+')!=-1:
    l = float(e[e.find('+')+1:])
    print(x*k+l)
else:
    l = float(e[e.rfind('-')+1:])
    print(x*k-l)
# Задание-2: Дата задана в виде строки формата 'dd.mm.yyyy', проверить корректно ли введена дата
# Условия коррекности:
# 1. День должен приводиться к целому числу в диапазоне от 1 до 30(31) (в зависимости от месяца, февраль не учитываем)
# 2. Месяц должен приводиться к целому числу в диапазоне от 1 до 12
# 3. Год приводиться к целому положитеьному числу в диапазоне от 1 до 9999
# 4. Длина исходной строки для частей должна быть в соответствии с форматом (т.е. 2 - для дня, 2- месяц, 4 -год)

# Пример корректной даты
date = '01.11.1985'

# Примеры некорректных дат
date = '01.22.1001'
date = '1.12.1001'
date = '-2.10.3001'

e = input()
q,w,r = e.split('.')
l = True
if int(r)<1 or int(r)>9999 or len(r)!=4:
    l = False
if int(w)<1 or int(w)>12 or len(w)!=2:
    l = False
if not (int(q)>0 and ((int(w) in [1,3,5,7,8,10,12] and int(q)<32) or (int(w) in [2,4,6,9,11] and int(q)<31))):
    l = False
print(l)
# Задание-3: "Перевернутая башня" (Задача олимпиадного уровня)
#
# Вавилонцы решили построить удивительную башню — расширяющуюся к верху и содержащую бесконечное число этажей и комнат.
# Она устроена следующим образом — на первом этаже одна комната, затем идет два этажа
# на каждом из которых по две комнаты, затем идёт три этажа, на каждом из которых по три комнаты и так далее:
#         ...
#     12  13  14
#     9   10  11
#     6   7   8
#       4   5
#       2   3
#         1
#
# Эту башню решили оборудовать лифтом --- и вот задача: нужно научится по номеру комнаты определять,
# на каком этаже она находится и какая она по счету слева на этом этаже.
#
# Входные данные: В первой строчке задан номер комнаты N, 1 ≤ N ≤ 2 000 000 000.
#
# Выходные данные:  Два целых числа — номер этажа и порядковый номер слева на этаже.
#
# Пример:
# Вход: 13
# Выход: 6 2
#
# Вход: 11
# Выход: 5 3
n = int(input())
a = 0
b = 0
while n>0:
    a+=1
    b+=a
    n-=a**2
n+=a**2
b-=a
s = (n-1)//a
n-=s*a
print(b+s+1,n)
